org/maxima.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: maxima
#+latex_header: \input{header.tex}
#+TITLE: maxima

* references
- [[http://maxima.sourceforge.net/docs/manual/maxima.html][Maxima manual]]
- [[file:Tensor_manipulation_in_GPL_Maxima_by_Viktor_Toth_in_2007.org][Tensor manipulation in GPL Maxima by Viktor Toth in 2007]]
  - [[https://www.vttoth.com/CMS/projects/61-the-maxima-computer-algebra-system][Viktor Toth's up-to-date implementations of atensor, ctensor, itensor]]
- [[http://web.csulb.edu/~woollett/][Edwin Woollett's Maxima by Example]]
- [[file:Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009.org][Catalogue of Spacetimes by Mueller and Grave in 2009]]
- Test conversion of [[https://github.com/ernestyalumni/mathphysics/blob/master/playground/GR.ipynb][mathphysics/GR.ipynb at master · ernestyalumni/mathphysics]] into [[file:maxima.org][maxima]] via [[file:Tensor_manipulation_in_GPL_Maxima_by_Viktor_Toth_in_2007.org][Tensor manipulation in GPL Maxima by Viktor Toth in 2007]].
- [[https://github.com/calyau/maxima-tutorial-notebooks][calyau/maxima-tutorial-notebooks]]
* maxima in org-babel
:PROPERTIES:
:ID:       41c89366-efb8-49c3-8c09-5c6f1f2369d0
:END:
- Note maxima does not have sessions
** general usage
- If we want to generate tex from maxima in org-mode files we can use [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-maxima.html#org40fb6cc][Inline Display of Maxima LaTeX Output]]

#+NAME: solve-maxima
#+HEADER: :exports none
#+BEGIN_SRC maxima :results raw
  tex(exp(-x)/x);
#+END_SRC

#+RESULTS: solve-maxima
$${{e^ {- x }}\over{x}}$$

- Example of Taylor series

#+NAME: taylor-series-maxima
#+HEADER: :exports none
#+BEGIN_SRC maxima :results raw
  tex(taylor(U(x), x, a, 2));
#+END_SRC

#+RESULTS: taylor-series-maxima
$$U\left(a\right)+\left(\left.{{d}\over{d\,x}}\,U\left(x\right)
 \right|_{x=a}\right)\,\left(x-a\right)+{{\left(\left.{{d^2}\over{d\,
 x^2}}\,U\left(x\right)\right|_{x=a}\right)\,\left(x-a\right)^2
 }\over{2}}+\cdots $$

** plotting

#+name: 3d-maxima
#+HEADER: :exports none
#+begin_src maxima :results graphics file :file maxima-3d.pdf :programmode false;
plot3d(atan(-x^2+y^3/4),[x,-4,4],[y,-4,4],[grid,50,50],[gnuplot_pm3d,true], [pdf_file,"./maxima-3d.pdf"]);
#+end_src

#+RESULTS: 3d-maxima
[[file:maxima-3d.pdf]]

*** COMMENT General output from plotting block
#+CAPTION: Some caption
#+NAME: fig:maxima-3d-plot
#+ATTR_LaTeX: :height 5cm :placement [!htpb]
#+ATTR_HTML: :width 480
[[file:maxima-3d.pdf]]

*** Test figure inclusion of arbitrary file
#+CAPTION: Some caption
#+NAME: fig:maxima-3d-plot
#+LABEL: fig:maxima-3d-plot
#+ATTR_LaTeX: :height 5cm :placement [!htpb]
#+ATTR_HTML: :width 480
file:maxima-3d.pdf
